app/views/users/new.html.erb

SELECT "roles".* FROM "roles"
---
    <% for role in Role.find(:all) %>
        <li><%= check_box_tag "user[role_ids][]", role.id, @user.roles.include?(role) %> <%= role.name %></li>