app/views/parents/_form.html.erb

SELECT "dependents".* FROM "dependents" WHERE ("dependents".parent_id = 1)
---
    <table class="formTable">
    <% @parent.dependents.each do |dependent| %>

SELECT "gigs".* FROM "gigs" WHERE ("gigs".parent_id = 1)
---
    <table class="formTable">
    <% @parent.gigs.each do |gig| %>