app/controllers/dependents_controller.rb

  def show
    @dependent = Dependent.find(params[:id])
---
SELECT "dependents".* FROM "dependents" WHERE ("dependents"."id" = 1) LIMIT 1

  def create
    @dependent = Dependent.new(params[:dependent])

    respond_to do |format|
      if @dependent.save
---
INSERT INTO "dependents" ("age", "birth_day", "birth_month", "created_at", "diagnosed", "gender", "name", "need", "parent_id", "updated_at", "zip") VALUES (NULL, NULL, NULL, '2010-11-24 22:43:43.635181', NULL, NULL, 'Ethan', NULL, NULL, '2010-11-24 22:43:43.635181', '')