app/controllers/gigs_controller.rb

SELECT "gigs".* FROM "gigs"
---
  def index
    @gigs = Gig.all

INSERT INTO "gigs" ("created_at", "description", "name", "parent_id", "updated_at") VALUES ('2010-11-24 22:53:19.010544', '', 'My Gig', NULL, '2010-11-24 22:53:19.010544')
---
  def create
    respond_to do |format|
      if @gig.save

DELETE FROM "gigs" WHERE ("gigs"."id" = 1)
---
  def destroy
    @gig.destroy