app/controllers/parents_controller.rb

  def show
    @parent = Parent.find(params[:id])
---
SELECT "parents".* FROM "parents" WHERE ("parents"."id" = 1) LIMIT 1

  def edit
    @parent = Parent.find(params[:id])
---
SELECT "parents".* FROM "parents" WHERE ("parents"."id" = 1) LIMIT 1

  def create
    @parent = Parent.new(params[:parent])

    respond_to do |format|
      if @parent.save
---
INSERT INTO "parents" ("created_at", "gender", "how_use", "name", "updated_at", "zip") VALUES ('2010-11-24 22:53:06.296616', 'm', 'provider', 'abc', '2010-11-24 22:53:06.296616', '')

  def update
    @parent = Parent.find(params[:id])

    respond_to do |format|
      if @parent.update_attributes(params[:parent])
---
SELECT "parents".* FROM "parents" WHERE ("parents"."id" = 2) LIMIT 1
UPDATE "parents" SET "updated_at" = '2010-11-26 02:17:27.811630', "zip" = '' WHERE ("parents"."id" = 2)