app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "name", "title", "updated_at") VALUES ('<h3 style="color:blue;">